{
  "data": [
    {
      "position": "1",
      "q": "サイト内に動画を設置する際、視覚障がい者に対して気を付けるべきところはどれでしょう？",
      "qSelect": [
        "動画の代替コンテンツとして動画の内容を説明したテキストを動画の近くに用意する",
        "音声がきちんと出るようにする",
        "視覚障がい者には関係ないものなので、読み上げ機能を使った時に邪魔にならないようにする"
      ],
      "a": "A",
      "guide": "動画の中身が何なのかを把握できるように、動画の内容を説明する代替テキストを読み上げられる形で動画の近くに置く必要があります。動画内で動画を解説する音声を入れる形でもOKです。<br>ただし、背景動画等、サイト内で飾りとしておいてある動画に対しては不要です。"
    },
    {
      "position": "2",
      "q": "音声を含む動画を設置する際、聴覚障がい者に対して気を付けるべきところはどれでしょう？",
      "qSelect": [
        "字幕（キャプション）をつける",
        "映像に対して手話通訳士の映像をつける",
        "動画に対するコントローラーを設置する"
      ],
      "a": "A",
      "guide": "音声の内容が把握できるように字幕を設置する必要があります。②も対応方法としては正しいですが、トリプルAの達成基準になってくるのでシングルAでは不要です。"
    },
    {
      "position": "3",
      "q": "動画コンテンツの視覚障がい者への配慮として正しいものはどれでしょう？",
      "qSelect": [
        "視覚障がい者には関係ないものなので特に対応は不要",
        "動画プレイヤーがあると認識させるために前後に説明テキストを設置する",
        "音声データの中にある笑い声や喝采等はコンテンツの理解に関係ないものなので説明テキストには入れない"
      ],
      "a": "B",
      "guide": "視覚障がいがある方にもそこに動画コンテンツがあるとわかるようにするために、前後に説明テキストを設置する必要があります。"
    },
    {
      "position": "4",
      "q": "自動再生される音声が何秒以上の時に、停止、一時停止できるコントローラーが必要でしょう？",
      "qSelect": ["秒数に関係なく全ての音声で必要", "3秒", "5秒"],
      "a": "B",
      "guide": "スクリーンリーダーを使用している人は、同時に他の音声が再生されている場合、スクリーンリーダーによる読み上げ音声が聞き取りづらくなるため、音声制御ができるコントローラーが必要です。基本的に音声の自動再生はしない方がよいですが、もしどうしても必要な場合は最大3秒までにしておかなければなりません。"
    },
    {
      "position": "5",
      "q": "自動再生される動画やアニメーションは、何秒以上の時に停止、一時停止できるコントローラーが必要でしょう？",
      "qSelect": [
        "秒数に関係なく全ての動画、アニメーションで必要",
        "3秒",
        "5秒"
      ],
      "a": "C",
      "guide": "動きのある又は自動更新するコンテンツは、動きのあるオブジェクトを追うのが困難な利用者だけでなく、動かないテキストをすばやく読み取ることが困難な利用者にも障壁になりうる。スクリーンリーダーにも問題が発生する可能性がある。"
    },
    {
      "position": "6",
      "q": "次の入力エリアの構成で正しいものはどれでしょう？",
      "qSelect": [
        "ラベル＋入力エリア",
        "入力エリア＋プレースホルダーにラベル",
        "ラベルなし"
      ],
      "a": "A",
      "guide": "入力エリアへのラベルは必須になります。また、常時ラベルが見えている必要があるため、プレースホルダーでラベルを表現するのはNGです。"
    },
    {
      "position": "7",
      "q": "次の画面表示が切り替わるUIのうち、NGなものはどれでしょう？",
      "qSelect": [
        "タブ切り替え",
        "リアルタイムバリデーション",
        "セレクトボックスでの表示切り替え"
      ],
      "a": "C",
      "guide": "送信ボタンや確定ボタンを押下せずに、セレクトボックスで選択肢を切り替えただけで画面表示が変わったり遷移するような仕様はNGです。<br>コンテキストの変化は、その変化を知覚しづらい利用者、又は変化によって気を取られやすい利用者を混乱させてしまう恐れがあります。"
    },
    {
      "position": "8",
      "q": "メールアドレスの入力エリアで、メールアドレスを入力後にバリデーションエラーが発生したときに表示されるエラー文言で正しいものはどれでしょう？",
      "qSelect": [
        "入力してください",
        "エラーを修正してください",
        "メールアドレスは半角英数で入力してください"
      ],
      "a": "C",
      "guide": "より具体的な解決方法を提案する必要があるため、エラーを修正してくださいなどの抽象的なエラー表示はNGです。"
    },
    {
      "position": "9",
      "q": "画像を拡大できるようなUIをサイト内に設置する時、アクセシビリティの対応として正しいものはどれでしょう？",
      "qSelect": [
        "ピンチ機能に頼らず拡大、縮小ができるようなボタンを設置する",
        "ピンチ操作とバッティングしてしまうのでmetaタグviewportの設定で拡大機能をオフにする",
        "拡大時に要素が重なるのを防ぐため同一のUIをページ内に複数設置しないようにする"
      ],
      "a": "A",
      "guide": "ジェスチャを正確に実行できない人や、視線システムなど特殊な入力デバイスを使用している人もいるため、ポインタジェスチャでのみ操作できるUIや、指を複数必要とするようなUIはNGです。<br>PCならキーボード操作ができ、SPなら指一本で拡大縮小できるようなボタンを設置しましょう。"
    },
    {
      "position": "10",
      "q": "スマホ用のサイトを作成する際、NGな実装は次のうちどれでしょう？",
      "qSelect": [
        "PCとSPで使用する画像を変更する",
        "画面を横にした時に、「縦にして閲覧してください」等のポップアップを出す",
        "SPでのみハンバーガーメニューを出す"
      ],
      "a": "B",
      "guide": "動きによる操作のみでサイトを実装するのはNGです。<br>縦にしても横にしても表示される情報は変わらないようにしましょう。"
    },
    {
      "position": "11",
      "q": "画像、タイトル、日付、本文テキスト、タグを含んだ記事詳細ページを設計するとき、構成の順番（ = 表示上の順番）として正しいものはどれでしょう？",
      "qSelect": [
        "タイトル、画像、タグ、日付、本文テキスト",
        "タグ、画像、日付、タイトル、本文テキスト",
        "日付、画像、タグ、タイトル、本文テキスト"
      ],
      "a": "A",
      "guide": "構成上意味のある順番になっている必要があります。この場合、タイトルがhタグとなるためカードコンポーネントの中で一番最初に置く必要があります。<br>ただし、構成上難しい場合は②、③のような順番でもCSSで順序を変更することが可能です。"
    },
    {
      "position": "12",
      "q": "サイト内に表を設置する際（ただし画像ではなくコーディングで対応する）、気を付けるべき点はどれでしょう？",
      "qSelect": [
        "なるべく一つの表にまとめて、情報のまとまりがわかりやすいようにする",
        "表の見出しは行に設定する",
        "セルが結合されていたり、入れ子の構造になっているような表は避ける"
      ],
      "a": "C",
      "guide": "スクリーリーダーによる利用性が下がったり、理解しづらくなってしまうため、なるべくシンプルな表にする必要があります。"
    },
    {
      "position": "13",
      "q": "ツールチップを実装する際気をつけるべき点はどれでしょう？",
      "qSelect": [
        "ホバーだけではなくキーボード操作でもツールチップが開けるようにする",
        "「ホバーするとツールチップが表示されます」等のガイドテキストを記載する必要がある",
        "ホバーが外れても一定時間は表示されるように配慮する"
      ],
      "a": "A",
      "guide": "ホバーでしか表示されない情報を載せるのはNGです。ツールチップを実装する場合はホバーで表示されるだけではなく、キーボード操作もできるようにしましょう。<br><br>ただし、ホバーで表示される要素はPCとSPで挙動が違ってくるため（SPではホバーができないためタップでの表示となる）、実装コストが嵩むことがあります。<br>本当に必要な機能なのか、SP同様クリックで表示する形にできないかを検討し、なるべくホバーで情報を表示するような仕様は避けるようにしましょう。"
    },
    {
      "position": "14",
      "q": "基本的にサイト内に点滅するコンテンツは置かないようにしたほうがよいですが、もし設置が必要となった場合、対応策としてどれが正しいでしょう？",
      "qSelect": [
        "点滅するコンテンツの色を暗くする",
        "点滅のスピードを1秒あたり3回未満にする",
        "10秒以上点滅したら点滅の動きを停止する"
      ],
      "a": "B",
      "guide": "てんかん発作の原因になることがあるため基本的に点滅するコンテンツを配置することは避けるべきですが、どうしても設置が必要となった場合は点滅のスピードを1秒あたり3回未満にするようにしましょう。<br><br>また、どんな形であれ5秒以上の点滅は動きを止める必要があります。③は10秒となっているため対応方法としてはNGです。"
    },
    {
      "position": "15",
      "q": "ページ内で複数の繰り返される要素が登場するときブロックスキップができるようにする必要がありますが、対応として正しくないものはどれでしょう？",
      "qSelect": [
        "ページ上部に各セクションへ飛ぶアンカーリンクを設置する",
        "コンテンツの各セクションの開始位置に見出し要素を設置する",
        "サイト訪問時に各情報へアクセスできるリンクをポップアップで表示する"
      ],
      "a": "C",
      "guide": "ブロックスキップの仕組みはスクリーンリーダーを使うユーザーや、キーボード操作でページを閲覧しているユーザーがいた時に、見たい情報へ辿り着くまでに何度もキーボード操作をしなくてはならないような状況を避けるために必要です。<br>③のような、ユーザーが想定していない形で急にポップアップを出すのはNGです。アンカーリンクの設置や、見出しが適切に設定されていればスクリーンリーダーでブロックスキップの機能が使えるので対応としては十分です。"
    },
    {
      "position": "16",
      "q": "ページのタイトルを決める際正しいものはどれでしょう？",
      "qSelect": [
        "10文字以内で簡潔なタイトルにする",
        "他のページとの重複を避ける",
        "フォームの入力、確認、完了画面はすべて同じタイトルにする"
      ],
      "a": "B",
      "guide": "視覚障がいのある利用者が、複数のページが開いているとき、コンテンツを区別できるようにするために、重複するタイトルは避けましょう。<br>また、③のような、一見、どれも「お問い合わせ」になりそうな場合でも、きちんと「お問い合わせ - 完了」などのようにどのフェーズにいるのかがわかるようにするようにしましょう。"
    },
    {
      "position": "17",
      "q": "ニュースコンテンツに採用情報のお知らせを掲載する場合、タイトルとして最も望ましいものはどれでしょう？",
      "qSelect": [
        "採用のお知らせ",
        "2024年度採用のお知らせ",
        "採用面接のお知らせ"
      ],
      "a": "B",
      "guide": "②以外は前年度の記事タイトルとかぶってしまうおそれがあり、できる限りページタイトルの重複は避けたほうが良いため、年度を入れるなど、他のページと区別しやすい形にできていることが望ましいです。"
    },
    {
      "position": "18",
      "q": "サイトTOPに実績をいくつか掲載しているセクションがあった場合、詳細ページへのリンクを示す文言として望ましいものはどれでしょう？",
      "qSelect": ["もっと見る", "実績詳細を見る", "MORE"],
      "a": "B",
      "guide": "リンク先が何になるのかを、リンク単体でわかるようにすることが望ましいです。前後のテキストの関係性で、「もっと見る」が実績をもっと見る、と判断できる場合もありますが、リンクを一覧化した時などに「もっと見る」のみだと遷移先の情報がわからないためユーザーは混乱してしまいます。"
    },
    {
      "position": "19",
      "q": "サイトにオープニングアニメーションをつけたい場合、何秒以上でアニメーションをスキップできるボタンやコントローラーが必要になるでしょう？",
      "qSelect": [
        "5秒",
        "7秒",
        "オープニングアニメーションであればコントローラーは不要"
      ],
      "a": "A",
      "guide": "オープニングアニメーションに関わらずですが、5秒以上自動で再生されるアニメーションやコンテンツに対してはコントローラーを設置する必要があります。<br>コントローラーを設置すればOKというよりも、できる限り5秒を超えるようなアニメーションは避けるようにしましょう。"
    },
    {
      "position": "20",
      "q": "スライダーを設置する際、アクセシビリティに配慮されたUIはどれでしょう？",
      "qSelect": [
        "自動再生はするがスライダーにホバーすると動きが停止するスライダー",
        "自動再生し、前後に進むボタンのみのスライダー",
        "自動再生せず、前後に進むボタンのみのスライダー"
      ],
      "a": "C",
      "guide": "自動で更新されるようなコンテンツは、認知機能が低いユーザーにとって情報を得るのが難しくなってくるため、時間制限を設けないことが望ましいです。①の場合、キーボード操作をしているユーザーやスマホでの操作ができなくなってしまうのでNGです。②の場合、自動再生をさせたい場合は近くに停止、再生などのコントローラーを設置する必要があります。③の場合、自動再生がそもそもされないため、停止、再生などのボタンを設置する必要がなく、一番アクセシビリティに配慮された形となります。"
    },
    {
      "position": "21",
      "q": "アクセシビリティに配慮したフォームを実装する際誤っているものはどれでしょう？",
      "qSelect": [
        "TABや矢印キーのみでもフォーカスの移動、選択が行えるようにする",
        "電話番号など、決まった桁数の入力を検知したら次のフィールドにフォーカスするようにする",
        "セレクトボックスやラジオボタンにデフォルト値を設定する"
      ],
      "a": "B",
      "guide": "②はユーザーが意図しない挙動である可能性が高いため避けましょう。<br>フォームはキーボードで操作できるようにしておく必要があるため①の対応は必須です。<br>セレクトボックスやラジオボタンにデフォルト値を設定することは特に問題ありません。"
    },
    {
      "position": "22",
      "q": "アクセシビリティに配慮したモーダルを実装する際、正しいものはどれでしょう？",
      "qSelect": [
        "キーボード操作時にフォーカスがモーダルの外の要素に当たらないようにする",
        "キーボード操作時の混乱を避けるためモーダル内にリンク要素を置かない",
        "キーボード操作でモーダルを閉じた時、フォーカスはページのTOPに戻るようにする"
      ],
      "a": "A",
      "guide": "モーダルの外の要素にフォーカスが当たってしまうと、モーダル自体にフォーカスを戻すことができなくなってしまい、モーダルを閉じることができなくなってしまうため、外の要素にフォーカスが当たらないように配慮する必要があります。<br>②は特に問題ありません。<br>③はモーダルが閉じるたびにページの上部に移動してしまうとユーザーが何度も元に位置に戻る必要が出てきてしまうためNGです。"
    },
    {
      "position": "23",
      "q": "キーボード操作でページを閲覧する人に配慮した場合、アクセシビリティ対応として正しいものはどれでしょう？",
      "qSelect": [
        "フォーカスが当たっているのがわかりやすくなるようにフォーカスの色を変更する",
        "各キーに対してサイトを閲覧しやすくなるようなショートカットを設置し、そのショートカットに関するガイドを明記する",
        "フォーカスの当たる順序をコンテンツの見た目の順序と揃える"
      ],
      "a": "C",
      "guide": "字を読むのが困難な障がいのある利用者は、Tab キーを押下してフォーカスが予期しないどこかへ移動してしまうと、迷子のようになってしまう恐れがあるため、コンテンツの見た目とフォーカスの順序は揃えることが望ましいです。<br><br>①は一見OKそうに見えますが、トンマナを揃えるためにアクセントカラーを設定した場合など、想定していない箇所でフォーカスが背景に溶け込んでしまう可能性があるため、デフォルトから変更しないほうがよいです。<br>②は、勝手にキーボード操作の機能を設定してしまうとユーザーが混乱してしまうため避けましょう。"
    }
  ]
}
